{
  "heading" : "10 HIGHLIGHTS FROM STAR WARS: ICONS OF THE GALAXY",
  "date" : "30.1.2018.",
  "images" : [
    {
      "src" : "images/news/news11.jpg",
      "alt" : "leia"
    },

    {
      "src" : "images/news/news11_1.jpg",
      "alt" : "leia and stormtroopers"
    },

    {
      "src" : "images/news/news11_2.jpg",
      "alt" : "terror troopers"
    },

    {
      "src" : "images/news/news11_3.jpg",
      "alt" : "marvel"
    },

    {
      "src" : "images/news/news11_4.jpg",
      "alt" : "luke skywalker"
    },

    {
      "src" : "images/news/news11_5.jpg",
      "alt" : "c3po"
    },

    {
      "src" : "images/news/news11_6.jpg",
      "alt" : "lando"
    },

    {
      "src" : "images/news/news11_7.jpg",
      "alt" : "carrie and little boy"
    },

    {
      "src" : "images/news/news11_8.jpg",
      "alt" : "hunk of junk"
    },

    {
      "src" : "images/news/news11_9.jpg",
      "alt" : "vader poster"
    },

    {
      "src" : "images/news/news11_10.jpg",
      "alt" : "lightsaber"
    }
  ],

  "content" : [
    "Available today, Star Wars: Icons of the Galaxy gathers some of Star Wars Insider‘s greatest recent articles. The special collection includes interviews with Carrie Fisher and Harrison Ford, a comprehensive look at the legendary Marvel comic-book adaptation of Star Wars, and much more. Here are 10 highlights that you won’t want to miss, straight from editor Jonathan Wilkins.",

    "<strong>1. Princess of the people.</strong> Princess Leia gets an in-depth profile as Tricia Barr examines the groundbreaking appeal of one of the most iconic characters in the entire saga. As an added bonus, we present a short interview with the much-missed Carrie Fisher at her funniest and most outspoken!",

    "<strong>2. Imperial icons.</strong> The Empire’s terrifying stormtroopers have been a symbol of terror in the Star Wars saga ever since they debuted during the explosive opening of A New Hope! Acclaimed Star Wars author Jason Fry examines the Emperor’s most loyal warriors.",

    "<strong>3. Make Mine Marvel!</strong> Take a trip back in time to the first Marvel age of Star Wars as acclaimed creators Roy Thomas and Howard Chaykin discuss the making of the wild, wacky, and above all, memorable original run of comics.",

    "<strong>4. Star Wars style.</strong> From Lando’s cape to C-3PO’s gleaming gold suit, the costumes of the Star Wars saga are as icon as the characters themselves. In this extended feature, we look behind the scenes at the creation of the outfits worn by lead and sometimes background characters.",

    "<strong>5. A conversation with C-3PO.</strong> Programmed for protocol and etiquette, C-3PO has been a mainstay of the saga. The same is true of Anthony Daniels, who has the distinction of being the longest serving actor to appear in the Star Wars. Here he reveals some secrets from his long career.",

    "<strong>6. Lando and Lobot.</strong> Billy Dee Williams lends a touch of suave in a classic interview, while the late John Hollis looks back on his experience making of The Empire Strikes Back.",

    "<strong>7. When Artoo met Wicket.</strong> This vintage interview features two much-loved performers who fans have taken to their hearts. Warwick Davis and the late, great Kenny Baker share their experiences on the original trilogy ahead of the release of the prequels!",

    "<strong>8. The fastest hunk of junk in the toybox.</strong> One of the most iconic parts of the entire saga, the Millennium Falcon is the ship every kid (and quite a few adults!) wanted. Kenner gave us the opportunity to get our hands on Han solo’s pride and joy and this feature examines how a toy can be a true Star Wars icon!",

    "<strong>9. Empire posters.</strong> As befits a movie often cited as the very best the saga has to offer, The Empire Strikes Back boasts numerous posters that are stunning works of art in their own right. This feature presents a gallery with exclusive commentary by renowned Star Wars historian Pete Vilmur.",

    "<strong>10. A flash of inspiration.</strong> Even for those less familiar with the Star Wars saga than visitors to this site, the lightsaber is a household name. What many don’t know is that the story of how the hilt of the lightsaber was created is both fascinating, and in many ways, improbable. Designer Roger Christian reveals how he built a Star Wars icon from what seemed like very little, indeed…"
  ]
}
