{
  "heading" : "5 HIGHLIGHTS FROM THE SOLO: A STAR WARS STORY TEASER TRAILER",
  "date" : "5.2.2018.",
  "images" : [
    {
      "src" : "images/news/news12_1.jpg",
      "alt" : "solo and a gun"
    },

    {
      "src" : "images/news/news12_2.jpg",
      "alt" : "car ride"
    },

    {
      "src" : "images/news/news12_3.jpg",
      "alt" : "spaceshuttle"
    },

    {
      "src" : "images/news/news12_4.jpg",
      "alt" : "solo"
    },

    {
      "src" : "images/news/news12_5.jpg",
      "alt" : "lightspeed"
    },

    {
      "src" : "images/news/news12_6.jpg",
      "alt" : "emilia"
    }
  ],

  "content" : [
    "The teaser trailer for Solo: A Star Wars Story is here, offering a portrait of the scoundrel as a young man — and so much more. We get Han, Chewie, new characters, new vehicles, weird aliens in floating jars, and some giant tentacles. Here are five highlights of many.",

    "1. “I’m gonna be a pilot. Best in the galaxy.” Only one person could have the bravura to say that and the talent to back it up. For anyone who loves Han Solo, it’s thrilling to turn back the clock and see the rogue scoundrel before he met Luke and Obi-Wan in Mos Eisley, before he said “I know,” and before he became a legend. The opening narration by Alden Ehrenreich, delivered with classic Solo world-weariness, gives us a glimpse of who Solo was and where he’s going. “I’ve been running scams on the street since I was 10.” We’re not surprised.",

    "2. Hello, what have we here? The style. The smile. That’s Lando, and Donald Glover — in just a few images — manages to capture the fan-favorite’s essence perfectly. He appears cool and collected (until he’s not, like when a giant tentacle is about to swat the Falcon), and we can’t wait to see more of him.",

    "3. The Millennium Falcon — was clean? Maybe the biggest shocker of all is that a ship that’s been called a “hunk of junk,” a “bucket of bolts,” and “garbage” ever looked remotely nice. This teaser trailer shows that before we first saw it in all its beat-up glory (and still thought it was the coolest thing ever) in A New Hope, the Falcon had indeed seen better days.",

    "4. That Western feel. From a desert standoff to the mention of a “crew,” much of the imagery and tone of the Solo: A Star Wars Story teaser trailer seems rooted in classic Westerns — appropriate, considering that the genre was a major influence on the original Star Wars. And especially fitting for an early tale about a scoundrel who blasts bounty hunters under cantina tables.",

    "5. Home run. We’ve seen Han pull off some fancy moves with the Falcon, and this might be the best. With a TIE fighter close by, Han spins, smashing the smaller craft away and into a fiery explosion. Just awesome, and a moment that exemplifies the Falcon’s can’t-be-matched cool factor. For best results, play on repeat.",

    "Bonus: “I might be the only person who knows…what you really are.” Actress Emilia Clarke’s Qi’ra brings some straight talk to Solo, and Ehrenreich’s reaction is pure Han: trying to be tough yet letting his vulnerability sneak through. It’s a very human moment, and that relatability is why Han Solo remains our favorite nerf herder."
  ]
}
