{
  "heading" : "HOW THE LAST JEDI NOVELIZATION CONNECTS TO A GALAXY OF STAR WARS BOOKS AND COMICS",
  "date" : "21.2.2018.",
  "images" : [
    {
      "src" : "images/news/news10_1.jpg",
      "alt" : "last jedi - jason fry"
    },

    {
      "src" : "images/news/news10_2.jpg",
      "alt" : " ray training force"
    },

    {
      "src" : "images/news/news10_3.jpg",
      "alt" : "supreme leader snoke"
    },

    {
      "src" : "images/news/news10_4.jpg",
      "alt" : "from a certain point of view"
    },

    {
      "src" : "images/news/news10_5.jpg",
      "alt" : "phasma"
    },

    {
      "src" : "images/news/news10_6.jpg",
      "alt" : "leia"
    },

    {
      "src" : "images/news/news10_7.jpg",
      "alt" : "ben solo"
    },

    {
      "src" : "images/news/news10_8.jpg",
      "alt" : "general hux"
    }
  ],

  "content" : [
    "It’s a galaxy full of stories! Rian Johnson’s The Last Jedi screenplay picks up where The Force Awakens left off, includes a famous holographic plea from A New Hope, and shows us Luke Skywalker discussing Darth Sidious and the Jedi of the prequel era.",

    "The result is a story that’s rich and deep, full of connections to stories we know and love. In writing the novelization of that story, I saw a chance to further those connections by drawing on not just Star Wars movies and TV shows but also on novels written by my fellow authors. In introducing Rey, I wanted to back up a little so we could spend a bit more time with her before her fateful meeting with Luke atop the island of Ahch-To. I went back to Alan Dean Foster’s The Force Awakens novelization, making sure my account was consistent with how Alan had approached that scene. The introduction of sisters Rose and Paige Tico, meanwhile, recreates a scene from Elizabeth Wein’s Cobalt Squadron.",

    "I worked really hard to make the Force a presence in the novelization, almost as if it’s a character in its own right. Several characters — Luke, Rey, Leia Organa, Snoke, Kylo Ren, and Maz Kanata – perceive the Force and seek to understand its will. Those perceptions and interactions can be very different, but I wanted them to have an underlying unity, as if they were all part of a larger conversation among the galaxy’s Force-users.",

    "The Weapon of a Jedi, my 2015 book is showing Luke learning critical early lessons about the Force and fighting his first lightsaber duel. Luke’s critical insight in Weapon — that the Force is generated by life, yet overspills the boundaries of the living things that create it. But I also relied on explorations of the Force from my fellow authors. Three stories in the 2017 anthology From a Certain Point of View were an enormous help. Claudia Gray’s “Master and Apprentice” packs a wealth of ideas into seven short pages, and gave me insights into Force ghosts and the slippery nature of time in relation to the will of the Force. A fun aspect of a novelization is getting to delve into characters’ thoughts, motivations, and pasts in a way that can be difficult on-screen. As with my interpretation of the Force, that task was a lot easier because of great ideas from my fellow authors.",

    "For Phasma, where else could I turn but Delilah S. Dawson’s Phasma? Finn recalls a barracks rumor about Phasma’s origins which readers will recognize as a second- or thirdhand account of the real story of Phasma on her homeworld of Parnassos. And when Finn, Rose, and DJ infiltrate the Supremacy, he passes on a bit of stormtrooper training that originated in Delilah’s novel. The novelization opens with a startling first line and a dream sent to Luke by the Force as a warning. In Luke’s dream, he never left Tatooine and grew old in a very different galaxy ruled by a triumphant Empire.",

    "Writing and interpreting scenes with Leia Organa was one of the greatest pleasures of writing the novelization — and one of the biggest responsibilities. Claudia’s Bloodline and Leia: Princess of Alderaan were critical here, with Leia recalling her first mission to Crait from the latter book. Some of my favorite new scenes in the novelization delve into Leia’s sense of duty and the emotional toll it’s taken on her — a theme that Cecil Castellucci and I explored in our 2015 collaboration Moving Target.",

    "Kylo Ren — or, if you prefer, Ben Solo — demanded a balancing act in the novelization. We of course wanted to know more about his past and his thoughts about the future…but at the same time, I had to be careful not to do anything that might step on Episode IX’s storytelling. Still, I was able to give us glimpses of his childhood, including Leia’s memory of Ben in the womb — a scene that reaches back to Chuck Wendig’s Aftermath trilogy.",

    "Chuck’s trilogy told us some of what happened to the Empire after the Battle of Endor, supplying critical information for the novelization’s account of the Contingency and the rise of the First Order. A young Armitage Hux is also a character in those books, as is his father Brendol. Brendol was first glimpsed in my own Servants of the Empire books, in which Zare Leonis discovers the seeds of Brendol’s scheme for training stormtroopers from birth — a program put into place by Armitage, and recalled by him in the novelization.",

    "George Lucas’ galaxy far, far away is also the world’s best sandbox, with people who create movies, novels, comics, videogames, and more all getting to sit side-by-side, share their toys, and use them to tell new stories."
  ]
}
