{
  "heading" : "THE INTRODUCTION OF KYLO REN AND THE MEANING OF A MASK",
  "date" : "26.1.2018.",
  "images" : [
    {
      "src" : "images/news/news9_1.jpg",
      "alt" : "kylo 1"
    },

    {
      "src" : "images/news/news9_2.jpg",
      "alt" : "kylo 2"
    },

    {
      "src" : "images/news/news9_3.jpg",
      "alt" : "kylo 3"
    },

    {
      "src" : "images/news/news9_4.jpg",
      "alt" : "kylo 4"
    },

    {
      "src" : "images/news/news9_5.jpg",
      "alt" : "kylo 5"
    },

    {
      "src" : "images/news/news9_6.jpg",
      "alt" : "kylo 6"
    },

    {
      "src" : "images/news/news9_7.jpg",
      "alt" : "kylo 7"
    }
  ],

  "content" : [
    "The creators of The Force Awakens chose to not shy away from comparisons that this new Star Wars villain would draw to one of the most iconic bad guys of all time, Darth Vader. They decided to instead embrace comparisons between the two characters and use their similarities as a narrative device. J.J. Abrams noted in his commentary for The Force Awakens, “The character of Kylo Ren was one of the most challenging characters because he sort of embodied what this movie was. It was a new story, a new personality created from the DNA of what had come before, but because he was the villain it meant he was in the shadow of Darth Vader one of the great villains in cinema history.”",

    "As the film opens, Lor San Tekka hands Resistance pilot Poe Dameron secret information in a small Jakku village. Before Poe can escape, First Order troopers arrive and start rounding up its inhabitants. When Poe looks up in the sky, he sees the descent of Kylo Ren’s shuttle, a sleek bat-like ship much more refined than the bulky Atmospheric Assault Landers the First Order troopers arrived in minutes before. Kylo walking down the landing ramp of his command shuttle with First Order troopers at attention is very reminiscent of Darth Vader walking down the ramp of his Imperial shuttle at the beginning of Return of the Jedi.",

    "All of these visual clues let the audience know without a doubt that this isn’t just any bad guy, this is the bad guy in charge. The music during this scene is Kylo Ren’s theme, which is suitably bold and dramatic. Kylo Ren’s wardrobe is a callback to the garb of past dark-side servants, with a somewhat Vader-esque face-covering mask that alters his natural voice. Audiences at this point don’t know that Kylo is Darth Vader’s grandson and that the resemblance is an attempt to honor the deceased Sith Lord. The mystery of who is behind this menacing mask encourages the audience to wonder what kind of person (human? cyborg? Sith Lord?) is underneath it.",

    "After Lor San Tekka speaks to him about a time before he was known as Kylo Ren, Kylo heartlessly kills Lor San Tekka and then orders the death of the village’s inhabitants in his obsessive quest to find the map to Luke Skywalker. He certainly doesn’t seem to give these actions a second thought, which makes the scene that much more scary and disturbing. The red crossguard lightsaber Kylo uses to kill Lor San Tekka is a huge clue to audiences that he has Force powers, and Kylo’s next move leaves viewers no doubt that he is a similar threat to the Resistance as Vader was to the Rebellion. Kylo is not only showing that he can use the Force in this shot, he’s also showing us that he has an impressive amount of control of his powers — perhaps a larger amount of control than those who came before him.",

    "After Kylo Ren orders Poe to be taken aboard his ship, audiences have seen nothing from his character that suggests he is anything but a powerful, ruthless, Force-strong killer. Kylo’s actions throughout the film are unquestionably evil, but his journey to the dark side does not appear complete, and his role as a leader of the First Order does not remain unquestioned. Throughout the film, Kylo wavers between controlled evil and emotional instability. Kylo has the discipline to invade the thoughts of Poe Dameron, but he is also prone to fits of violent rage when things don’t go his way or he is challenged.",

    "Kylo’s mask, and the removal of it are representative of the identity crisis he experiences in different sections of the film. Kylo doesn’t need to wear his mask to survive as Darth Vader did; he instead uses it as a means of intimidation and as a way to perhaps mentally separate himself from his previous life as Ben Solo. Anakin’s change to Darth Vader was physically permanent. He was, as Obi-Wan said, “more machine now than man,” but Kylo Ren’s mask is more of a symbolic prop.",

    "The removal of Kylo Ren’s mask in different scenes of The Force Awakens lets the audience see the conflict he feels before he murders his own father. Earlier, an unmasked Kylo Ren allows Rey to look into his eyes, and then see his fears when he is attempting to pry information from her mind. Kylo Ren shows a sign of wanting to be seen as a man and not a monster when he rips off his mask after Rey calls him a “creature in a mask” in this same scene. Rey saw Kylo Ren’s mask as a weakness and exploited his insecurities about it, which is a far cry from the scenes in the original trilogy where Vader’s subordinates were visibly horrified by his mask and the man wearing it. Kylo’s destruction of his mask can also be read as a clear turning point for the character — one that would influence everything that would follow in The Last Jedi."
  ]
}
