{
  "heading" : "THESE CRYSTAL FOX SCONES WILL SHOW YOU THE WAY TO DELICIOUSNESS",
  "date" : "1.3.2018.",
  "images" : [
    {
      "src" : "images/news/news5_1.jpg",
      "alt" : "vulptex"
    },

    {
      "src" : "images/news/news5_2.jpg",
      "alt" : "making of"
    },

    {
      "src" : "images/news/news5_3.jpg",
      "alt" : "glaze"
    },

    {
      "src" : "images/news/news5_4.jpg",
      "alt" : "cookies"
    }
  ],

  "content" : [
    "Star Wars: The Last Jedi introduced the mineral planet of Crait where fans became acquainted with a new unique species known as vulptex, or the crystal fox. These crystal critters are easily recognized by their white, crystalline fur. In this recipe, standing in for the luminous pelt are coarse sanding sugar crystals, which give off the same shiny, eye-catching glow. They are sprinkled atop a buttery glazed scone, ideal for serving at a proper intergalactic tea." ,

    "In this recipe, standing in for the luminous pelt are coarse sanding sugar crystals, which give off the same shiny, eye-catching glow. They are sprinkled atop a buttery glazed scone, ideal for serving at a proper intergalactic tea.",

    "<strong>Vulptex Sugar Crystal Fox Scones</strong><i>What You’ll Need:</i> Coarse sanding sugar crystals, black icing, blue sparkle gel, white icing...Some ingredients: 2 cups all-purpose flour 1/2 cup sugar, 1/2 teaspoons baking powder, Pinch of salt, 1/2 cup unsalted butter, 1 egg, 1/4 sour cream,1/4 heavy cream, 1/4 teaspoon vanilla... Glaze ingredients:1/2 cups powdered sugar 2 Tablespoons unsalted butter, melted 1/2 teaspoon vanilla, 2-3 Tablespoons whole milk, as needed.",

    "<strong>Step 1:</strong> Preheat the oven to 400 degrees. Prep a baking sheet with a silpat or parchment.<strong>Step 2:</strong> In a large bowl, whisk together the flour, sugar, baking powder, and salt. Using a pastry cutter, cut in the butter until the mixture is crumbly.<strong>Step 3:</strong> Add the egg, sour cream, heavy cream, and vanilla until combined.<strong>Step 4:</strong> Form small balls of the dough and shape into vulpex-like head shapes, approximately 3-inches tall. Place on the prepped sheets.",

    "<strong>Step 5:</strong> Bake for 12-14 minutes depending on your oven. Let cool on a wire rack.",

    "<strong>Step 6:</strong> In a bowl mix together the powdered sugar, melted butter, vanilla, and milk. Add more milk as needed to get the right consistency. Dip the cooled scones into the glaze, then dip into the sanding sugar crystals.",

    "<strong>Step 7:</strong> With a #4 tip and black icing add the nose and eye details, along with blue sparkle gel for the pupils of the eyes. Use the white icing and a #5 tip to add more face details. Once the icing is dry the scones are ready to serve."
  ]
}
