[
  {
    "heading" : "5 THINGS WE LEARNED FROM “THE FORCE OF SOUND",
    "images" : [
      {
        "src" : "images/news/news1_1.jpg",
        "alt" : "poe and bb-8"
      },

      {
        "src" : "images/news/news1_2.jpg",
        "alt" : "porgs"
      },

      {
        "src" : "images/news/news1_3.jpg",
        "alt" : "holdo"
      },

      {
        "src" : "images/news/news1_4.jpg",
        "alt" : "kylo ren"
      }
    ],

    "content" : [
      "It’s sound that gives each digital character weight and personality, making everything from the tiniest gestures to the big climactic moments feel authentic. Behind the scenes, there’s a team of audio experts at work to find the perfect noise to evoke emotion or heighten drama through an extensively layered mix or, sometimes, the complete absence of sound.
      Here are five fascinating things we learned from “The Force of Sound: Creating sounds in galaxy far, far away”",

      "<strong>1. In the recording booth, BB-8 doesn’t look at all like you might think.</strong> To create the illusion that the spherical astromech is rolling through each scene, the sound effects team in the studio rolls a granite orb on a special box. It’s just one example in a vast arsenal of strange props and tools that help audio engineers and sound designers capture the magic of a galaxy far, far away. “It’s like an old radio play,” says Matthew Wood, supervising sound editor.",

      "<strong>2. The porg sound was one of the first elements tackled for the film.</strong>
       Ahch-To’s resident space puffins provided one of the first challenges for sound designer Ren Klyce and his team.“Birdlike. Kind of annoying but not too annoying.” Real bird sounds, sped up and played at a higher pitch, and one intern’s turkey call helped to create the perfect trilling squawk to complement the wide-eyed creatures and their innocent on-screen demeanor." ,

      "<strong>4. Sometimes it’s the absence of sound that makes the moment come alive…</strong>
       There’s a moment just after the Holdo maneuver where the sound vanishes, replaced by utter silence. “The film’s so bombastic with noise that at the largest moment when Snoke’s ship is being destroyed by Holdo doing her kamikaze/seppuku run into it…to have then an explosion there just would have been fine,” says Klyce. “The idea to have nothing there was more interesting and to kind of make everybody wait for it.”",

      "<strong>5. …or hints at a deeper connection to the Force.</strong>
       Sound designers went through trial and error to help Johnson convey his vision for the most vulnerable moments of Force connection between Kylo Ren and Rey. “(Sound) can expand something to make it feel bigger than it is, it can make you feel small and intimate if you’ve pared everything away and taken out sound and left a little vacuum,” says Wood.
       And when they approached the final battle between Luke Skywalker and his nephew, audio and visual clues hinted that the Jedi Master wasn’t physically on Crait long before the big reveal. Listen closely and you can hear debris sizzling on Kylo’s saber. When the camera pans to Luke, there’s nothing, not even the sound of his footfalls. “We tried to juxtapose that so you’re getting clues,” Wood says."
    ]
  }
]
