{
  "heading" : "IN THE LAST JEDI, REY’S JOURNEY IN THE MIRROR CAVE ECHOES A STAR WARS CYCLE",
  "date" : "13.3.2018.",
  "images" : [
    {
      "src" : "images/news/news7.jpg",
      "alt" : "trio"
    },

    {
      "src" : "images/news/news7_1.jpg",
      "alt" : "ray"
    },

    {
      "src" : "images/news/news7_2.jpg",
      "alt" : " anakin"
    },

    {
      "src" : "images/news/news7_3.jpg",
      "alt" : "luke vs vader"
    },

    {
      "src" : "images/news/news7_4.jpg",
      "alt" : "ray"
    }
  ],

  "content" : [
    "Star Wars has always been circular, and that’s why it’s no surprise that there are similarities in the journeys between Anakin, Luke, and Rey as they each navigate the middle parts of their trilogies. Rey’s trip inside the mirror cave strongly resembles Luke’s test on Dagobah against the spectre of Vader, and the imagery even goes back further to Anakin’s trip to the well of the dark side in the Mortis trilogy in Star Wars: The Clone Wars.",

    "In the Mortis trilogy, Anakin Skywalker is shown what he will become and when he learns this, he turns directly to the dark, willing to embrace the evil in himself to prevent greater atrocities in the future. He sees himself as Vader reflected in the vision and this explains the key flaw in Anakin that terrifies Luke about Rey so much: Anakin is willing to go straight to the dark if he perceives a payoff in the light. Ultimately, he still becomes Darth Vader.",

    "Years later, on Dagobah, Yoda tells Luke that the only thing in the cave, which he describes as a domain of evil, is what he takes with him. Luke is confronted with the thing he’s most terrified of: Vader.When he struck Vader, cutting his head off, what does he see? His own terrified face reflected in his fear. Was this to mean that Vader was always a Skywalker? Or that Luke could turn down the path of Vader? In either case, it’s a poignant bit of imagery that has allowed our minds to divine what its true meaning might be endlessly over the years.",

    "Like Anakin and Luke before her, Rey is called to a well of the dark side to confront her fear. For Rey, this fear is her lack of belonging and her emotional reliance on her parents. It’s also interesting to note that the imagery of Rey and Anakin’s respective wells of the dark side are opposites. Anakin’s is set deep in a flow of boiling lava, bright red and hot. Rey’s is in a cold, damp place, surrounded by water. Luke’s is a middle ground between the two in a steamy, swampy marsh, both hot and wet, a bridge between the two.",

    "Luke’s vision comes true in a sense when Vader reveals his true identity to Luke. There is a Skywalker in the Vader suit, and Luke has to grapple with the truth of his own identity as well. If his father was inside Vader, could there be Vader inside him? Rey has to grapple with this in the opposite way. The mirror shows Rey her own face and she’s not ready to confront what this means. She doesn’t want to admit what Maz told her plainly in The Force Awakens, her family was “never coming back.”. Connections like these help tie the Skywalker saga together through the generations, from Anakin to Luke to Ben, with each of them participating in different parts of the myth, in a way that deepens our understanding and bind the characters together in unexpected ways."
  ]
}
