{
  "heading" : "IN THE LAST JEDI, REY’S JOURNEY IN THE MIRROR CAVE ECHOES A STAR WARS CYCLE",
  "date" : "8.2.2018.",
  "images" : [
    {
      "src" : "images/news/news8_1.jpg",
      "alt" : "footage"
    },

    {
      "src" : "images/news/news8_2.jpg",
      "alt" : " lando"
    },

    {
      "src" : "images/news/news8_3.jpg",
      "alt" : "mysterious guys"
    },

    {
      "src" : "images/news/news8_4.jpg",
      "alt" : "solo flirting"
    },

    {
      "src" : "images/news/news8_5.jpg",
      "alt" : "in a spaceshuttle"
    }
  ],

  "content" : [
    "Entertainment Weekly pulled back the curtain on Solo: A Star Wars Story this week, with several great articles on the making of the film, plot and character details, and more. Here are some of the highlights, along with new photos revealed.",

    "Entertainment Weekly pulled back the curtain on Solo: A Star Wars Story this week, with several great articles on the making of the film, plot and character details, and more. Here are some of the highlights, along with new photos revealed. ",

    "The droid seen saluting Lando in the teaser is named L3-37 (played by Phoebe Waller-Bridge through motion capture). L3-37 is Lando’s sidekick — she has some personality and she’s somewhat self-made. “She’s a self-modified droid,” co-writer Jon Kasdan told EW‘s Anthony Breznican. “The idea is that she’s sort of a mutt, if you will, of various parts of different kinds of droids who has improved upon herself.”",

    "Alden Ehrenreich’s Han Solo will link up with a whole slew of shady folks, including Tobias Beckett (Woody Harrelson), Val (Thandie Newton), and gangster Dryden Vos (Paul Bettany). How good or bad are they? We’ll find out. “He likes to know his way in and out of any situation that he’s in,” Donald Glover told EW of his scoundrel. “Lando likes rules because he’s somebody who is in a position to benefit from rules.”",

    "Check out additional new photos below, and for more on Solo: A Star Wars Story, pick up the new issue of Entertainment Weekly featuring Anthony Breznican’s cover story, available today."
  ]
}
