{
  "heading" : "5 WAYS BOMBER COMMAND CONNECTS TO THE LARGER STAR WARS UNIVERSE",
  "date" : "31.1.2018.",
  "images" : [
    {
      "src" : "images/news/news6.jpg",
      "alt" : "page tico"
    },

    {
      "src" : "images/news/news6_1.jpg",
      "alt" : " leia"
    },

    {
      "src" : "images/news/news6_2.jpg",
      "alt" : "battleships"
    },

    {
      "src" : "images/news/news6_3.jpg",
      "alt" : "creatures"
    },

    {
      "src" : "images/news/news6_4.jpg",
      "alt" : "battleship"
    }
  ],

  "content" : [
    "For anyone excited to learn more about Paige Tico, her sister Rose, or other Resistance fighters, look no further than Jason Fry’s Bomber Command. Bomber Command is a journal-style book filled with illustrations, and fold-out pages written from the perspective of Paige, a ball-turret gunner for the Resistance.",

    "<strong> 1. It provides a backstory for Paige, Rose, and Cobalt Squadron.</strong> Bomber schematics for Paige’s ship, Cobalt Hammer, and details of the magno-charges in the bomb bay we see Paige climb through during the opening sequence of The Last Jedi start off the book. While detailing her family history, Paige reveals how she and Rose received their matching pendant necklaces and her plan to share stories of Finn’s heroics with Rose. Paige journal entry “we all need hope to get through this fight” serves as a nice set up for Rose and Finn’s introduction to each other in The Last Jedi.",

    "<strong>2. It adds details to the Force Awakens timeline.</strong> Since the timeline for Bomber Command is shortly before The Last Jedi, many of the entries flesh out what Leia and the Resistance were doing during the time Rey and Finn met on Jakku and made their way to the Resistance Base on D’Qar. A highlight for any Leia fan is the section of Bomber Command that includes the full address Leia gave to the New Republic Senate which warns the Senate of the increasing danger of the First Order. As of the unskilled are encouraged to enroll their children in “Frontier Corps” where children who are approved “will be guaranteed food, shelter, education, and the opportunity to make the galaxy a better place.” The Battlefront II storyline also references a secret operation, Project Resurrection, which focused on forcibly turning children into First Order troopers.",

    "<strong>3. It features bombers through time.</strong> Bomber Command has a lot of information about ships seen in The Last Jedi, but there’s also a bit of history in Paige’s journal about bombers such as the Y-wing, TIE bomber, and the Hyena Bomber. All of these ships were seen in the original trilogy movies, Star Wars: The Clone Wars, and even the video game Battlefront II.",

    "<strong>4. It includes creatures from across the galaxy.</strong> Fathiers, a clear favorite of Rose in The Last Jedi, start off this section that also includes creatures such as Jabba’s favorite snack, the gorg, from Return of the Jedi, and The Empire Strikes Back’s pesky power-cable-loving mynocks.",

    "<strong>5. It maps it all out.</strong> As the Star Wars universe expands, so does the need for maps to track the locations of different planets and systems. The First Order Space Galactic Map in Bomber Command includes planets that played a large part in multiple Star Wars films including Naboo, Endor, Jakku, and Yavin, as well as Paige’s current home on D’Qar with the Resistance."
  ]
}
