{
  "heading" : "5 THINGS WE LEARNED FROM STAR WARS: THE LAST JEDI – THE VISUAL DICTIONARY",
  "date" : "12.3.2018",
  "images" : [
    {
      "src" : "images/news/news4.jpg",
      "alt" : "visual dictionary"
    },

    {
      "src" : "images/news/news4_1.jpg",
      "alt" : "admiral ackbar"
    },

    {
      "src" : "images/news/news4_2.jpg",
      "alt" : "island living"
    },

    {
      "src" : "images/news/news4_3.jpg",
      "alt" : "holdo"
    },

    {
      "src" : "images/news/news4_4.jpg",
      "alt" : "executing orders"
    },

    {
      "src" : "images/news/news4_5.jpg",
      "alt" : "red trooper"
    }
  ],

  "content" : [
    "Even after multiple viewings, Star Wars: The Last Jedi is a trove of sights to discover, revealing more hints of a larger universe. But what better way to learn more about the characters, places, and things of the galaxy seen in The Last Jedi than to learn from the Star Wars: The Last Jedi – The Visual Dictionary from DK Publishing. Written by Pablo Hidalgo, whose role on the Lucasfilm Story Group ensures he’s in the know for everything happening in the Star Wars universe. The Visual Dictionary literally provides names and fills in the details that take us beyond the movie. Here’s some of the coolest tidbits of knowledge we learned from this comprehensive guide.",

    "<strong>1. Med ship, gun ship, two ships, one ship.</strong>We know from The Last Jedi that Vice Admiral Holdo is the commander of the Ninka before her promotion to lead the entire Resistance fleet, but which one is the Ninka? The Visual Dictionary has us covered — General Leia Organa’s Mon Calamari flagship is named after none other than the rebel admiral who backed up Jyn Erso’s mission to Scarif, Rogue One‘s Admiral Raddus. The Raddus is heavily automated and can project its deflector shield far from its hull, allowing it to defend smaller ships within range. Admiral Ackbar was the one to petition the naming of the ship after his fellow Mon Calamari hero.",

    "While it was difficult for the Resistance to find a map to Luke Skywalker, readers of this reference have it easy: there’s a map of the island on Ahch-To that is home to the origins of the Jedi. In addition to the Jedi Temple, and Jedi Village, where Rey and Luke stay, there’s also the mirror cave, and a separate village that is home for the Caretakers, the female Lanais who maintain the Jedi structures out of a sworn duty. You can read in more detail about the Lanais.",

    "<strong>Fellowship of the rings</string>The Visual Dictionary series excels at taking readers beyond the film by filling out the galaxy with extra details: everyday items that tell their own stories. Poe Dameron wears a ring on a necklace — it was his mother’s wedding ring, made from a steel washer from some old Rebellion machinery. Supreme Leader Snoke also had a ring — capped with a piece of obsidian from the catacombs below Darth Vader’s castle on Mustafar. Amilyn Holdo’s accessories represent the astronomy from her homeworld of Gatalenta. Even Luke Skywalker carries a piece that surely has a tale behind it — he keeps a bolo with a recovered Jedi Crusader pendant, carrying a trophy piece of a broken Sith lightsaber crystal.",

    "<strong>Executing orders<strong>Have you ever wondered who are those mysterious executioner troopers and why does the First Order resort to such theatrics for dispensing justice? I’m glad you axed! In a section on stormtroopers, we learn that public executions are part of the First Order’s way of clamping down on disloyalty. Instead of being a special unit assigned to a head honcho, any stormtrooper may be assigned to executioner duty for a day. While on regular duty, stormtroopers have their serial number broadcast from their helmets to other nearby helmet displays, but executioner helmets keep the axe-wielders anonymous from their peers, but not to their commanders.",

    "While Supreme Leader Snoke still has a mysterious background, many details about his Praetorian Guard are revealed. Shunning ranged weaponry, these four pairs of warriors protect the Supreme Leader from anyone afforded an audience with their reclusive boss. While their red armor link back to Emperor Palpatine’s brilliant red Royal Guard, their armor and weapons reveal their lethality. Their segmented armor is powered, able to create a localized magnetic field that helps deflect blaster fire and even glance off indirect lightsaber blows. Their weapons include the Bilari electro-chain whip, twin vibro-arbir blades that can be connected or separated, a vibro-voulge, and an electro-bisento. While the origins of the Praetorians remain a mystery, their name stems back to the 14th Atrisian Emperor of Kitel Phard."
  ]
}
